case/0_orig/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 290;

boundaryField
{
    bottom
    {
        type zeroGradient;
    }

    top
    {
        type zeroGradient;
    }

    left
    {
        type zeroGradient;
    }

    right
    {
        type zeroGradient;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}



// ************************************************************************* //
