case/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    top
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    left
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    right
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}


// ************************************************************************* //
