case/0_orig/alpha.air
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.air;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

minValue        0;
maxValue        1;

boundaryField
{
    bottom
    {
        type alphaContactAngle;

        contactAngleProperties
        {
            water
            {
                theta0 90;
            }
            contactFluid
            {
                theta0 90;
            }
        }

        value $internalField;
    }

    top
    {
        type inletOutlet;
        inletValue uniform 1;
        value      uniform 1;
    }

    left
    {
        type zeroGradient;
    }

    right
    {
        type zeroGradient;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}


