case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10000;
        startFace       19800;
    }
    top
    {
        type            patch;
        nFaces          10000;
        startFace       29800;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       39800;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       39900;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          100;
        startFace       40000;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          100;
        startFace       40100;
    }
)

// ************************************************************************* //
