case/constant/solidificationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidificationProperties;
}

// Latent heat 
// latentHeat      latentHeat    [0 2 -2 0 0 0 0]     3.34e5;
latentHeat      3.34e5;

// Solidus / Liquidus temperature 
//Tsolid          Tsolid        [0 0 0 1 0 0 0]      263.15;
//Tliquid         Tliquid       [0 0 0 1 0 0 0]      273.15;
Tsolid          250.15;
Tliquid         278.15;

// Thermal conductivity 
//kSolid          kSolid        [1 1 -3 -1 0 0 0]    2.0;
//kLiquid         kLiquid       [1 1 -3 -1 0 0 0]    0.6;
kSolid          10.0;
kLiquid         10.0;

// Heat capacities 
//cp              cp            [0  2 -2 -1 0 0 0]    4180;
//cpSolid         cpSolid       [0  2 -2 -1 0 0 0]    2000;
//cpLiquid        cpLiquid      [0  2 -2 -1 0 0 0]    4180;
cp              4180;
cpSolid         2000;
cpLiquid        4180;

// Densities 
//rhoSolid        rhoSolid      [1 -3 0 0 0 0 0]     920;
//rhoLiquid       rhoLiquid     [1 -3 0 0 0 0 0]     1000;
rhoSolid        1000;                                     // physikalisch: 920
rhoLiquid       1000;



