case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

phases (water air contactFluid);

// Water
water
{
    transportModel  Newtonian;
    nu              8.9e-7;     // kinematic viscosity
    rho             1000;
}

// Air
air
{
    transportModel  Newtonian;
    nu              1.5e-5;
    rho             1.2;
}

// Contact fluid
contactFluid
{
    transportModel  Newtonian;
    nu              1e-6;
    rho             900;
}

// Surface tension
sigma            0.072;
